<?php defined('SYSPATH') or die('No direct script access.');

return array(
	'alpha'         => 'Поле ":field" должно содержать только буквы',
	'alpha_dash'    => 'Поле ":field" должно содержать только буквы, цифры и подчеркивания',
	'alpha_numeric' => 'Поле ":field" должно содержать только буквы и цифры',
	'color'         => 'Поле ":field" должно быть кодом цвета',
	'credit_card'   => 'Поле ":field" должно быть номером кредитной карты',
	'date'          => 'Поле ":field" должно быть датой',
	'decimal'       => 'Поле ":field" должно быть десятичным числом с :param2 количеством цифр',
	'digit'         => 'Поле ":field" должно быть целым числом',
	'email'         => 'Поле ":field" должно быть адресом электронной почты',
	'email_domain'  => 'Поле ":field" должно быть существующим адресом электронной почты',
	'equals'        => 'Поле ":field" должно быть идентичным :param2',
	'exact_length'  => 'Поле ":field" должно быть длиной :param2 символов',
	'in_array'      => 'Поле ":field" должно быть одним из параметров',
	'ip'            => 'Поле ":field" должно быть ip-адресом',
	'matches'       => 'Поле ":field" должно равняться :param2',
	'min_length'    => 'Поле ":field" не должно быть короче :param2 символов',
	'max_length'    => 'Поле ":field" не должно быть длиннее :param2 символов',
	'not_empty'     => 'Поле ":field" не должно быть пустым',
	'numeric'       => 'Поле ":field" должно быть числом',
	'phone'         => 'Поле ":field" должно быть номером телефона',
	'range'         => 'Поле ":field" должно находиться между :param2 и :param3',
	'regex'         => 'Поле ":field" не соответствует требуемому формату',
	'url'           => 'Поле ":field" должно быть URL-адресом',
	'unique_sku'    => 'Поле ":field" должно быть уникальным',
	'unique_url'    => 'Поле ":field" должно быть уникальным',
	'valid_captcha' => 'Неверно заполнено поле ":field"',
);
